# Выведите  на экран строки (в последней строке n звездочек):
# *
# **
# ***
# ****
# *****

n = 5
z = "*"
x = "*"
for i in range(n):
    print(z)
    z = z + x




