# Пользователь вводит количество строк. Вывести на экран логотип соответствующего размера.
# Если текст не помещается, то вывести логотип без текста.
a = int(input("Введите число: "))
a = int(a / 2)

print(f"[[[[[[[[[[[[[[[       ]]]]]]]]]]]]]]]")
print(f"[::::::::::::::       ::::::::::::::]")
print(f"[::::::::::::::       ::::::::::::::]")
print(f"[::::::[[[[[[[:       :]]]]]]:::::::]")
for i in range(1, a, 1):
    print("[:::::[                      ]::::::]")
if a >= 1:
    print("[:::::[     CODE THE WORLD   ]::::::]")
    print("[:::::[www.itmathrepetitor.ru]::::::]")
else: print("[:::::[     CODE THE WORLD   ]::::::]")
for i in range(1, a, 1):
    print("[:::::[                      ]::::::]")
print(f"[::::::[[[[[[[:       :]]]]]]:::::::]")
print(f"[::::::::::::::       ::::::::::::::]")
print(f"[::::::::::::::       ::::::::::::::]")
print(f"[[[[[[[[[[[[[[[       ]]]]]]]]]]]]]]]")