# Выведите на экран прямоугольник из нулей. Количество строк вводит
# пользователь, количество столбцов равно 5.
# 00000
# 00000
# 00000
# 00000

num = int(input("Введите колличество строк: "))
s = 5

for i in range(num):
    print("00000")



