# Выведите следующие строки. Первая: 25  25.5  24.8. Вторая: 26 26.5 25.8.  И так далее. Последняя строка: 35 35.5 34.8.


a = 25
b = 0.5
c = 0.2
summ = 0

while a <= 34.8 + 1:
    print(a, end=", ")
    summ = a + b
    print(summ, end=", ")
    summ = a - c
    print(summ)
    a = a + 1
