# Вычислите |x|+x^5, если x=−2. Ответ: -30

x = -2
result = abs(x) + x ** 5
print(result)