# Выведите на экран n раз фразу "Silence is golden". Число n вводит пользователь

b = input("Колличество фраз: ")
b = int(b)
print(type(b))

a = "Silence is golden"

for i in range(b):
    print(a)




