# Выведите на экран числа 1, 2, 3, 4, ..., 20.

a = 0

for i in range(20):
    a = a + 1
    print(a, end=", ")
