 # Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
#

x = 7




if x <= 5:
    print("Этот день рабочий")
print("Этот день выходной - иди за пивом гад")