# Дано число. Если оно больше 3, то увеличить число на 10, иначе уменьшить на 10.

a = 2

if a > 3:
    a = a + 10
else:
    a = a - 10
print(a)
